Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.FaceBasedPlacementType
The placement type to be used if prompting to place an instance of a face-based family.
This option is ignored if placing a non-face-based family. If placing a face-based family, Default is an acceptable value, but will correspond to the first available selection in the user interface.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.SketchGalleryOptions
The sketch option provided when promt to place a family instance.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.PlaceAirTerminalOnDuct
If true, when placing an air terminal, the terminal will be placed directly on the duct without fittings.
If fase, the terminal will be placed with generated fittings.
Since:
2015

Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.#ctor(Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions)
Creates a copy of an existing options object.
other:
The options object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.#ctor
Creates a new PromptForFamilyInstancePlacementOptions using default options.
Since:
2015

Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions
This class contains options to control the behavior of interactive placement of family instances.
Since:
2015